testsuite/sysbench/results/oltp_read_write.lua_threads128/run.perf.log
sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 2243.20 qps: 44914.48 (r/w/o: 31445.52/8978.30/4490.66) lat (ms,95%): 94.10 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 2267.77 qps: 45352.28 (r/w/o: 31746.53/9070.20/4535.55) lat (ms,95%): 95.81 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 2292.98 qps: 45864.55 (r/w/o: 32106.72/9171.97/4585.86) lat (ms,95%): 92.42 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            1916926
        write:                           547760
        other:                           273923
        total:                           2738609
    transactions:                        137021 (2281.77 per sec.)
    queries:                             2738609 (45605.19 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2281.7676
    time elapsed:                        60.0506s
    total number of events:              137021

Latency (ms):
         min:                                   12.46
         avg:                                   56.11
         max:                                  185.84
         95th percentile:                       94.10
         sum:                              7687665.23

Threads fairness:
    events (avg/stddev):           1070.3984/17.94
    execution time (avg/stddev):   60.0599/0.03

sysbench 1.1.0 (using bundled LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 128
Warmup time: 10s
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

Warming up for 10 seconds...

[ 20s ] thds: 128 tps: 2435.17 qps: 48783.61 (r/w/o: 34152.03/9756.98/4874.61) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 128 tps: 2432.19 qps: 48634.56 (r/w/o: 34046.72/9723.46/4864.38) lat (ms,95%): 86.00 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 128 tps: 2416.24 qps: 48279.59 (r/w/o: 33792.89/9656.22/4830.48) lat (ms,95%): 87.56 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            2033481
        write:                           581198
        other:                           290578
        total:                           2905257
    transactions:                        145353 (2421.26 per sec.)
    queries:                             2905257 (48395.10 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

Throughput:
    events/s (eps):                      2421.2567
    time elapsed:                        60.0423s
    total number of events:              145353

Latency (ms):
         min:                                   12.75
         avg:                                   52.87
         max:                                  200.53
         95th percentile:                       87.56
         sum:                              7685261.39

Threads fairness:
    events (avg/stddev):           1135.5703/37.95
    execution time (avg/stddev):   60.0411/0.02